lab11_php_ci/ci4/app/Controllers/User.php

    public function login()
    {
        helper(['form']);
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        if (!$email)
        {
            return view('user/login');
        }

        $session = session();
        $model = new UserModel();
        $login = $model->where('useremail', $email)->first();
---
SELECT *
FROM `user`
WHERE `useremail` = 'humamfahurrahman@gmail.com'
 LIMIT 1